Revit 2027 API
Rebar.GetHostId Method
 The element that contains the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetHostId()
Public Function GetHostId As ElementId
public:
ElementId^ GetHostId()
member GetHostId : unit -> ElementId
Return Value
ElementId
 The element that the rebar object belongs to, such as a structural wall, floor, foundation, beam, brace or column.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace